# Lab 2: SQL Queries

### [name]

## Instruction
This lab is due at 11:59 pm on **Mar. 1, 2024**. You need to finish all questions of both In-class Assginment and Homework. Write your name in the above cell. Name your ipynb file as **StudentName_lab2.ipynb** and submit it on Blackboard. 

PLEASE ENSURE THAT THE SCRIPT CAN CORRECTLY EXECUTE!!!

In [107]:
#Let's load the sql extension and connect to a database **lab2.db** using:
%load_ext sql
#%reload_ext sql
%sql sqlite:///lab2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## In-class Assignment

### Exercise 1 [5 points]

Write SQL declarations for creating the schemas of the following three tables. Include necessary key constraints.

1. Employee(<u>eid</u>:integer, ename:string, age:integer, salary:real)

2. Works(<u>eid</u>:integer, <u>did</u>:integer, pct_time:integer)

3. Department(<u>did</u>:integer, dname:string, budget:real, managerid:integer)

The keys are underlined in each relation. Relation **Employee** stores employee information such as unique identifier **eid**, employee name **ename**, **age** and **salary**. Relation **Department** stores the department unique identifier **did**, department name **dname**, the department **budget** and **managerid** which is the **eid** of the employee who is managing the department. *The **managerid** value must always be found in the **eid** field of a record of the Employee relation.* The Works relation tracks which employee works in which department, and what **percentage** of the time s/he allocates to that department. Note that, an employee can work in several departments.

In [118]:
%%sql drop table if exists Employee;
CREATE TABLE Employee(
    eid integer PRIMARY KEY,
    ename CHAR(20),
    age integer,
    salary real);

drop table if exists Works;
CREATE TABLE Works(
    eid integer,
    did integer,
    pct_time integer);

drop table if exists Department;
CREATE TABLE Department(
    did integer PRIMARY KEY,
    dname CHAR(20),
    budget real,
    managerid integer,
    FOREIGN KEY(managerid) REFERENCES Employee(eid));

 * sqlite:///lab2.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Insert values to tables
Execute the cell below to insert values to the three tables.
1. Employee

| eid     | ename         | age | salary |  
|---------|---------------|-----|--------|
| 101     | Andrew Fuller | 40  | 50000  |
| 102     | Justin Peacock| 25  | 20000  |
| 103     | Nancy Buchanan| 35  | 30000  |
| 104     | Robert King   | 30  | 20000  |

2. Works:

| eid     | did  | pct_time | 
|---------|------|----------|
| 101     | 1001 | 100      |
| 102     | 1001 | 20       |
| 102     | 1002 | 50       |
| 102     | 1003 | 10       |
| 103     | 1003 | 90       |
| 103     | 1001 | 10       |
| 104     | 1001 | 20       |
| 104     | 1002 | 70       |

3. Department:

| did     | dname    | budget  | managerid |
|---------|----------|---------|-----------|
| 1001    | IT       | 500000  | 101       |
| 1002    | Computing| 750000  | 110       |
| 1003    | Finance  | 350000  | 103       |

In [109]:
%%sql
DELETE FROM Employee;
DELETE FROM Works;
DELETE FROM Department;
insert into Employee values ( 101,'Andrew Fuller', 40, 50000);
insert into Employee values ( 102, 'Justin Peacock', 25, 20000);
insert into Employee values ( 103, 'Nancy Buchanan', 35, 30000);
insert into Employee values ( 104, 'Robert King', 30, 20000);

insert into Department values (1001, 'IT', 500000, 101);
insert into Department values (1002, 'Computing', 750000, 110);
insert into Department values (1003, 'Finance', 350000, 103);

insert into Works values (101, 1001, 100);
insert into Works values (102, 1001, 20);
insert into Works values (102, 1002, 50);
insert into Works values (102, 1003, 10);
insert into Works values (103, 1003, 90);
insert into Works values (103, 1001, 10);
insert into Works values (104, 1001, 20);
insert into Works values (104, 1002, 70);

 * sqlite:///lab2.db
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### Exercise 2 [5 points]
Find the salaries of employees that work in the department 'Computing'

In [110]:
%%sql
Select E.Salary
From Employee E, Works W, Department D
Where (D.dname = 'Computing'
       AND W.did = D.did
       AND W.eid = E.eid)

 * sqlite:///lab2.db
Done.

[(20000.0,), (20000.0,)]

### Exercise 3 [5 points]
Find the ages of employees who work more than 30% of their time in a single department. List each age only once.

In [111]:
%%sql
Select Distinct E.age
From Employee E, Works W
Where (E.eid = W.eid 
       AND W.pct_time > 30)

 * sqlite:///lab2.db
Done.

[(40,), (25,), (35,), (30,)]

### Exercise 4 [5 points]
Find the name of departments who employ only persons of age 30 or younger. List each name only once.

In [112]:
%%sql
Select Distinct D.dname
From Department D, Works W, Employee E
Where (W.eid = E.eid
       AND D.did = W.did)
Group By W.did
Having Max(E.age) <= 30

 * sqlite:///lab2.db
Done.

[('Computing',)]

### Exercise 5 [5 points]
Find the names of employees who work in all departments

In [113]:
%%sql
SELECT E.ename
FROM Employee E
WHERE NOT EXISTS (
    SELECT D.did
    FROM Department D
    WHERE D.did NOT IN (
        SELECT W.did
        FROM Works W
        WHERE W.eid = E.eid))

 * sqlite:///lab2.db
Done.

[('Justin Peacock',)]

## Homework

### Question 1 [6 points]
Find the names of employees who are managers.

In [114]:
%%sql
Select E.ename, D.managerid as manager
From Employee E, Department D
Where E.eid = manager

 * sqlite:///lab2.db
Done.

[('Andrew Fuller', 101), ('Nancy Buchanan', 103)]

# Question 2 [6 points]
Find the ages of employees who work at least 50% of their time in a department called ‘Computing’ but who do not work in any department with budget less than $400,000.

In [115]:
%%sql
SELECT e.age
FROM Employee E
WHERE E.eid IN (
    SELECT W.eid
    FROM Works W, Department D
    WHERE W.did = D.did
    AND D.dname = 'Computing'
    AND W.pct_time >= 50)
AND E.eid NOT IN (
        SELECT W.eid
        FROM Works W, Department D
        WHERE W.did = D.did
        AND d.budget < 400000)

 * sqlite:///lab2.db
Done.

[(30,)]

### Question 3 [6 points]
Find the salaries of employees who work only in departments that have budget more than $400,000. List each salary value only once.

In [116]:
%%sql
Select Distinct E.Salary
From Department D, Works W, Employee E
Where (W.eid = E.eid
       AND D.did = W.did)
Group By W.did
Having Max(D.budget) >= 400000

 * sqlite:///lab2.db
Done.

[(50000.0,), (20000.0,)]

### Question 4 [7 points]
Find the names of employees who work in all departments with budget higher than $400,000

In [117]:
%%sql
SELECT E.ename
FROM Employee E
WHERE (NOT EXISTS (
    SELECT D.did
    FROM Department D
    WHERE D.did NOT IN (
        SELECT W.did
        FROM Works W
        WHERE W.eid = E.eid)
      AND D.budget > 400000))

 * sqlite:///lab2.db
Done.

[('Justin Peacock',), ('Robert King',)]